In [7]:
import pandas as pd
orange=pd.Series([1,3,5,7])
apple=pd.Series([2,4,6,8])
data={"Apple":apple,"Orange":orange}
fruit_df=pd.DataFrame(data)
fruit_df

   Apple  Orange
0      2       1
1      4       3
2      6       5
3      8       7

In [15]:
state=["Ohio","Ohio","Ohio","Nevda","Nevda","Nevda"]
data={"State":state,
     "Year":[2001,2002,2003,2004,2005,2006],
      "Population":[1.5,1.7,2.1,2.4,2.6,3.1],  }
frame=pd.DataFrame(data)
frame

   State  Year  Population
0   Ohio  2001         1.5
1   Ohio  2002         1.7
2   Ohio  2003         2.1
3  Nevda  2004         2.4
4  Nevda  2005         2.6
5  Nevda  2006         3.1

In [18]:
state=["Ohio","Ohio","Ohio","Nevda","Nevda","Nevda"]
data={"State":state,
     "Year":[2001,2002,2003,2004,2005,2006],
      "Population":[1.5,1.7,2.1,2.4,2.6,3.1],  }
frame=pd.DataFrame(data, index=["1st", "2nd", "3rd", "4th" , "5th", "6th"])
frame

     State  Year  Population
1st   Ohio  2001         1.5
2nd   Ohio  2002         1.7
3rd   Ohio  2003         2.1
4th  Nevda  2004         2.4
5th  Nevda  2005         2.6
6th  Nevda  2006         3.1

In [20]:
#Print top 5 values
frame.head()

     State  Year  Population
1st   Ohio  2001         1.5
2nd   Ohio  2002         1.7
3rd   Ohio  2003         2.1
4th  Nevda  2004         2.4
5th  Nevda  2005         2.6

In [22]:
frame=pd.DataFrame(data, columns=["Year","Population","State"])
frame

   Year  Population  State
0  2001         1.5   Ohio
1  2002         1.7   Ohio
2  2003         2.1   Ohio
3  2004         2.4  Nevda
4  2005         2.6  Nevda
5  2006         3.1  Nevda

In [25]:
frame=pd.DataFrame(data, columns=["Year","Population","State","Dept"],
                  index=['one','two','three','four','five','six'])
frame

       Year  Population  State Dept
one    2001         1.5   Ohio  NaN
two    2002         1.7   Ohio  NaN
three  2003         2.1   Ohio  NaN
four   2004         2.4  Nevda  NaN
five   2005         2.6  Nevda  NaN
six    2006         3.1  Nevda  NaN

In [26]:
frame.columns

Index(['Year', 'Population', 'State', 'Dept'], dtype='object')

# A Columns in a DataFrame can be retrived as a Series either by dict-like notation or a atribute:

In [33]:
#That is dict-like Notation
data["State"]

['Ohio', 'Ohio', 'Ohio', 'Nevda', 'Nevda', 'Nevda']

In [35]:
frame["Year"]

one      2001
two      2002
three    2003
four     2004
five     2005
six      2006
Name: Year, dtype: int64

In [ ]:
#there